xinghaozhe/BCM/JBC012_B501_20120408_S1.5/Souces/Src/stm8_linuart.c
/**
  ********************************************************************************
  * @file stm8_linuart.c
  * @brief This file contains all the functions for the LINUART peripheral.
  * @author STMicroelectronics
  * @version V0.04
  * @date 21-DEC-2007
  ******************************************************************************
  *
  * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
  * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
  * TIME. AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY
  * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
  * FROM THE CONTENT OF SUCH SOFTWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
  * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
  *
  * <h2><center>&copy; COPYRIGHT 2007 STMicroelectronics</center></h2>
  * @image html logo.bmp
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm8_linuart.h"
#include "stm8_clk.h"

/* LINKER SECTIONS DEFINITION FOR THIS FILE ONLY */
#ifdef USE_COSMIC_SECTIONS
#pragma section (LINUART_CODE)
#pragma section const {LINUART_CONST}
#pragma section @near [LINUART_URAM]
#pragma section @near {LINUART_IRAM}
#pragma section @tiny [LINUART_UZRAM]
#pragma section @tiny {LINUART_IZRAM}
#endif

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/

/* Private functions ---------------------------------------------------------*/
/* Public functions ----------------------------------------------------------*/

/** @}
  * @addtogroup LINUART_Public_Functions
  * @{
  */

/**
 * @brief Clears the LINUART flags.
 * @par Full description:
 * Clears the LINUART flags.
 * @param[in] LINUART_FLAG specifies the flag to clear
 *  This parameter can be one of the following values:
 *                       - LINUART_FLAG_LBD
 *                       - LINUART_FLAG_TXE
 *                       - LINUART_FLAG_TC
 *                       - LINUART_FLAG_RXNE
 *                       - LINUART_FLAG_IDLE
 *                       - LINUART_FLAG_SBK
 *                       - LINUART_FLAG_ORE_LHE
 *                       - LINUART_FLAG_NE
 *                       - LINUART_FLAG_FE
 *                       - LINUART_FLAG_PE
 *                       - LINUART_FLAG_LHDF     
 *                       - LINUART_FLAG_LSF    
 * @retval void None
 * @par Required preconditions:
 * None
 * @par Called functions:
 * None
 * @par Example:
 * Clear the LINUART TC flag
 * @code
 * LINUART_ClearFlag(LINUART_FLAG_TC);
 * @endcode
 */

void LINUART_ClearFlag(LINUART_Flag_TypeDef LINUART_FLAG)
{
  u8 dummy =0x00;
  assert_param(IS_LINUART_FLAG_VALUE_OK(LINUART_FLAG));

  switch (LINUART_FLAG)
  {
      /*< Clear the Transmit Register Empty flag    */
    case LINUART_FLAG_TXE:
      LINUART->DR = (u8)0x00;
		  break;
      /*< Clear the Transmission Complete flag      */
    case LINUART_FLAG_TC:
     dummy = LINUART->SR;
     LINUART->DR = (u8)0x00;
      break;
      /*< Clear the Receive Register Not Empty flag */
    case LINUART_FLAG_RXNE:
      dummy = LINUART->DR; /*< Read Data Register   */
      break;
      /*< Clear the Idle Detection flag             */
    case LINUART_FLAG_IDLE:
      /*< Clear the Overrun Error flag or Clear the LIN Header Error flag       */
    case LINUART_FLAG_ORE_LHE:
      /*< Clear the Noise Error flag                */
    case LINUART_FLAG_NE:
      /*< Clear the Framing Error flag              */
    case LINUART_FLAG_FE:
      /*< Clear the Parity Error flag               */
    case LINUART_FLAG_PE:
      dummy = LINUART->SR; /*< Read Status Register */
      dummy = LINUART->SR; /*< Read Status Register */  /*TBD*/
      dummy = LINUART->DR; /*< Read Data Register   */
      break;

      /*< Clear the LIN Break Detection flag */
    case LINUART_FLAG_LBD:
      LINUART->CR4 &= (u8)(~LINUART_CR4_LBDF);
      break;
    case LINUART_FLAG_LHDF:
      /* LINUART->CR5; */ /*TBD*/
      break;
    case LINUART_FLAG_LSF:
      LINUART->CR5 &= (u8)(~LINUART_CR5_LSF); /*TBD*/
      break;
    case LINUART_FLAG_SBK:
      LINUART->CR2 &= (u8)(~LINUART_CR2_SBK);
      break;
    default:
      break;
  }
}
/**
 * @brief Clears the LINUART pending Bit.
 * @par Full description:
 * Clears the LINUART pending bit.
 * @param[in] LINUART_FLAG specifies the flag to clear
 *  This parameter can be one of the following values:
 *                       - LINUART_FLAG_LBD
 *                       - LINUART_FLAG_TXE
 *                       - LINUART_FLAG_TC
 *                       - LINUART_FLAG_RXNE
 *                       - LINUART_FLAG_IDLE
 *                       - LINUART_FLAG_ORE_LHE
 *                       - LINUART_FLAG_PE
 *                       - LINUART_FLAG_LHDF     
 * @retval void None
 * @par Required preconditions:
 * None
 * @par Called functions:
 * None
 * @par Example:
 * Clear the LINUART TC flag
 * @code
 * LINUART_ClearFlag(LINUART_FLAG_TC);
 * @endcode
 */

void LINUART_ClearITPendingBit(LINUART_Flag_TypeDef LINUART_FLAG)
{
  u8 dummy =0x00;
  assert_param(IS_LINUART_ITPENDINGBIT_VALUE_OK(LINUART_FLAG));

  switch (LINUART_FLAG)
  {
      /*< Clear the Transmit Register Empty pending bit    */
    case LINUART_FLAG_TXE:
      LINUART->DR = (u8)0x00;
	    break;
      /*< Clear the Transmission Complete pending bit      */
    case LINUART_FLAG_TC:
      dummy = LINUART->SR;
      LINUART->DR = (u8)0x00;
      break;
      /*< Clear the Receive Register Not Empty pending bit */
    case LINUART_FLAG_RXNE:
      dummy = LINUART->DR; /*< Read Data Register   */
			dummy = LINUART->DR; /*< Read Data Register   */
      break;
      /*< Clear the Idle Detection pending bit             */
    case LINUART_FLAG_IDLE:
      /*< Clear the Overrun Error flag or Clear the LIN Header Error pending bit       */
    case LINUART_FLAG_ORE_LHE:
      /*< Clear the Parity Error pending bit               */
    case LINUART_FLAG_PE:
      dummy = LINUART->SR; /*< Read Status Register */
      dummy = LINUART->SR; /*< Read Status Register */  /*TBD*/
      dummy = LINUART->DR; /*< Read Data Register   */
      break;

      /*< Clear the LIN Break Detection pending bit */
    case LINUART_FLAG_LBD:
      LINUART->CR4 &= (u8)(~LINUART_CR4_LBDF);
      break;
    case LINUART_FLAG_LHDF:
      /* LINUART->CR5; */ /*TBD*/
      break;
    case LINUART_FLAG_NE:
    case LINUART_FLAG_FE:
    case LINUART_FLAG_LSF:
    case LINUART_FLAG_SBK:
    default:
      break;
  }
}

/**
  * @brief Enable the LINUART peripheral.
  * @par Full description:
  * Enable the LINUART peripheral.
  * @param[in] NewState new state of the LINUART Communication.
  *                    This parameter can be: ENABLE or DISABLE.
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Enable LINUART peripheral.
  * @code
  * LINUART_Cmd(ENABLE);
  * @endcode
  */
void LINUART_Cmd(FunctionalState NewState)
{

  if (NewState)
  {
    LINUART->CR1 &= (u8)(~LINUART_CR1_UARTD); /**< LINUART Enable */
  }
  else
  {
    LINUART->CR1 |= LINUART_CR1_UARTD;  /**< LINUART Disable (for low power consumption) */
  }
}

/**
  * @brief Deinitializes the LINUART peripheral.
  * @par Full description:
  * Set the LINUART peripheral registers to their default reset values.
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Deinitialize LINUART peripheral.
  * @code
  * LINUART_DeInit();
  * @endcode
  */

