xinghaozhe/BCM/JBC012_B501_20120408_S1.5/Souces/Src/stm8_linuart.c
void LINUART_DeInit(void)
{
  u8 dummy;
  /*< Clear the Idle Line Detected bit in the status rerister by a read
     to the LINUART_SR register followed by a Read to the LINUART_DR register */
  dummy = LINUART->SR;
  dummy = LINUART->DR;

  LINUART->BRR2 = LINUART_BRR2_RESET_VALUE;  /*< Set LINUART_BRR2 to reset value 0x00 */
  LINUART->BRR1 = LINUART_BRR1_RESET_VALUE;  /*< Set LINUART_BRR1 to reset value 0x00 */

  LINUART->CR1 = LINUART_CR1_RESET_VALUE; /*< Set LINUART_CR1 to reset value 0x00  */
  LINUART->CR2 = LINUART_CR2_RESET_VALUE; /*< Set LINUART_CR2 to reset value 0x00  */
  LINUART->CR3 = LINUART_CR3_RESET_VALUE;  /*< Set LINUART_CR3 to reset value 0x00  */
  LINUART->CR4 = LINUART_CR4_RESET_VALUE;  /*< Set LINUART_CR4 to reset value 0x00  */
  LINUART->CR5 = LINUART_CR5_RESET_VALUE; /*< Set LINUART_CR5 to reset value 0x00  */

}


/**
  * @brief Checks whether the specified LINUART flag is set or not.
  * @par Full description:
  * Checks whether the specified LINUART flag is set or not.
  * @param[in] LINUART_FLAG specifies the flag to check.
  *                    This parameter can be one of the following values:
  *                       - LINUART_FLAG_LBD
  *                       - LINUART_FLAG_TXE
  *                       - LINUART_FLAG_TC
  *                       - LINUART_FLAG_RXNE
  *                       - LINUART_FLAG_IDLE
  *                       - LINUART_FLAG_ORE_LHE
  *                       - LINUART_FLAG_NE
  *                       - LINUART_FLAG_FE
  *                       - LINUART_FLAG_PE
  *                       - LINUART_FLAG_SBK
  *                       - LINUART_FLAG_LHDF
  *                       - LINUART_FLAG_LSF 
  * @retval FlagStatus (SET or RESET)
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Check the status of TC flag.
  * @code
  * FlagStatus TC_flag;
  * TC_Flag = LINUART_GetFlagStatus(LINUART_FLAG_TC);
  * @endcode
  */
FlagStatus LINUART_GetFlagStatus(LINUART_Flag_TypeDef LINUART_FLAG)
{
  FlagStatus status = RESET;
  u8 itpos = 0;

  /* Check parameters */
  assert_param(IS_LINUART_FLAG_VALUE_OK(LINUART_FLAG));

  /* Get the LINUART_FLAG index*/
  itpos = (u8)((u8)1 << (u8)((u8)LINUART_FLAG & (u8)0x0F));

  /* Check the status of the specified LINUART flag*/
  switch (LINUART_FLAG)
  {
    case LINUART_FLAG_LBD:
      if ((LINUART->CR4 & itpos) != (u8)0x00)
      {
        /* LINUART_FLAG is set*/
        status = SET;
      }
      else
      {
        /* LINUART_FLAG is reset*/
        status = RESET;
      }
      break;
      /*< Returns the Transmit Data Register Empty flag     */
    case LINUART_FLAG_TXE:
      /*< Returns the Transmission Complete flag state   */
    case LINUART_FLAG_TC:
      /*< Returns the Read Data Not Empty flag state     */
    case LINUART_FLAG_RXNE:
      /*< Returns the IDLE Detection flag state          */
    case LINUART_FLAG_IDLE:
      /*< Returns the Overrun Error flag state           */
    case LINUART_FLAG_ORE_LHE:
      /*< Returns the Noise Error flag state             */
    case LINUART_FLAG_NE:
      /*< Returns the Framing Error flag state           */
    case LINUART_FLAG_FE:
      /*< Returns the Parity Error flag state            */
    case LINUART_FLAG_PE:

      if ((LINUART->SR & itpos) != (u8)0x00)
      {
        /* LINUART_FLAG is set*/
        status = SET;
      }
      else
      {
        /* LINUART_FLAG is reset*/
        status = RESET;
      }

      break;
      /*< Returns the Send Break flag state */
    case LINUART_FLAG_SBK:
      if ((LINUART->CR2 & itpos) != (u8)0x00)
      {
        /* LINUART_FLAG is set*/
        status = SET;
      }
      else
      {
        /* LINUART_FLAG is reset*/
        status = RESET;
      }
      break;
    case LINUART_FLAG_LHDF:
    case LINUART_FLAG_LSF:
      if ((LINUART->CR5 & itpos) != (u8)0x00)
      {
        status = SET;
      }
      else
      {
        status = RESET;
      }
      break;
    default:
      status = SET;
      break;
  }
  /* Return the LINUART_FLAG status*/
  return  status;
}
/**
  * @brief Checks whether the specified LINUART interrupt has occurred or not.
  * @par Full description:
  * Checks whether the specified LINUART interrupt has occurred or not.
  * @param[in] LINUART_FLAG Specifies the LINUART interrupt source to check.
	*  This parameter can be one of the following values:
  *                       - LINUART_FLAG_LBD
  *                       - LINUART_FLAG_TXE
  *                       - LINUART_FLAG_TC
  *                       - LINUART_FLAG_RXNE
  *                       - LINUART_FLAG_IDLE
  *                       - LINUART_FLAG_ORE_LHE
  *                       - LINUART_FLAG_PE
  *                       - LINUART_FLAG_LHDF  
  * @retval ITStatus The new state of LINUART_IT (SET or RESET).
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * @code
  * IT_Status PIEN_ITStatus;
  * PIEN_ITStatus = LINUART_GetITStatus(LINUART_FLAG_TC);
  * @endcode
  */
ITStatus LINUART_GetITStatus(LINUART_Flag_TypeDef LINUART_FLAG)
{

  ITStatus pendingbitstatus = RESET;
  u8 itpos = 0;
  u8 itmask1 = 0;
  u8 itmask2 = 0;
  u8 enablestatus = 0;

  /* Check parameters */
  assert_param(IS_LINUART_ITPENDINGBIT_VALUE_OK(LINUART_FLAG));

  /* Get the LINUART IT index*/
  itpos = (u8)((u8)1 << (u8)((u8)LINUART_FLAG & (u8)0x0F));
  /* Get the LINUART IT index*/
  itmask1 = (u8)((u8)LINUART_FLAG >> (u8)4);
  /* Set the IT mask*/
  itmask2 = (u8)((u8)1 << itmask1);

  switch (LINUART_FLAG)
  {
    case LINUART_FLAG_LBD:
      /* Get the LINUART_FLAG enable bit status*/
      enablestatus = (u8)((u8)LINUART->CR4 & itmask2);
      /* Check the status of the specified LINUART interrupt*/
      if (((LINUART->CR4 & itpos) != (u8)0x00) && enablestatus)
      {
        /* Interrupt occurred*/
        pendingbitstatus = SET;
      }
      else
      {
        /* Interrupt not occurred*/
        pendingbitstatus = RESET;
      }
      break;

    case LINUART_FLAG_PE:

