xinghaozhe/BCM/JBC012_B501_20120408_S1.5/Souces/Src/stm8_linuart.c
      /* Get the LINUART_FLAG enable bit status*/
      enablestatus = (u8)((u8)LINUART->CR1 & itmask2);
      /* Check the status of the specified LINUART interrupt*/

      if (((LINUART->SR & itpos) != (u8)0x00) && enablestatus)
      {
        /* Interrupt occurred*/
        pendingbitstatus = SET;
      }
      else
      {
        /* Interrupt not occurred*/
        pendingbitstatus = RESET;
      }
      break;

    case LINUART_FLAG_TXE:
    case LINUART_FLAG_TC:
    case LINUART_FLAG_RXNE:
    case LINUART_FLAG_IDLE:
    case LINUART_FLAG_ORE_LHE:
      /* Get the LINUART_FLAG enable bit status*/
      enablestatus = (u8)((u8)LINUART->CR2 & itmask2);
      /* Check the status of the specified LINUART interrupt*/
      if (((LINUART->SR & itpos) != (u8)0x00) && enablestatus)
      {
        /* Interrupt occurred*/
        pendingbitstatus = SET;
      }
      else
      {
        /* Interrupt not occurred*/
        pendingbitstatus = RESET;
      }
      break;
    case LINUART_FLAG_LHDF:
      /* Get the LINUART_FLAG enable bit status*/
      enablestatus = (u8)((u8)LINUART->CR5 & itmask2);
      /* Check the status of the specified LINUART interrupt*/
      if (((LINUART->CR5 & itpos) != (u8)0x00) && enablestatus)
      {
        /* Interrupt occurred*/
        pendingbitstatus = SET;
      }
      else
      {
        /* Interrupt not occurred*/
        pendingbitstatus = RESET;
      }
      break;
    case LINUART_FLAG_NE:
    case LINUART_FLAG_FE:
    case LINUART_FLAG_LSF:
    case LINUART_FLAG_SBK:
    default:
      pendingbitstatus = SET;
      break;
  }

  /* Return the LINUART_FLAG status*/
  return  pendingbitstatus;

}

/**
  * @brief Fills LINUART_InitStruct members with default value.
  * @param[in] LINUART_InitStruct Pointer to LINUART_Init_TypeDef structure that will be initialized.
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * @code
  * LINUART_Init_TypeDef LINUART_InitStructure;
  * LINUART_StructInit(&LINUART_InitStructure);
  * @endcode
  */
void LINUART_StructInit(LINUART_Init_TypeDef* LINUART_InitStruct)
{
  LINUART_InitStruct->WordLength          = LINUART_WORDLENGTH_8D;
  LINUART_InitStruct->StopBits            = LINUART_STOPBITS_1;
  LINUART_InitStruct->Parity              = LINUART_PARITY_NO;
  LINUART_InitStruct->BaudRate            = (u32)9600;
  LINUART_InitStruct->Mode                = LINUART_MODE_TXRX_ENABLE;
}
	
/**
  * @brief Initializes the LINUART according to the specified parameters.
  * @retval void None
  * @par Required preconditions:
  * You can call LINUART_InitStruct before in order to initialize the structure members.
  * @par Called functions:
  * CLK_GetClockFreq().
  * @par Example:
  * @code
  * LINUART_Init_TypeDef LINUART_InitStructure;
  * LINUART_Init(&LINUART_InitStructure);
  * @endcode
  */
void LINUART_Init(LINUART_Init_TypeDef* LINUART_InitStruct)
{
  u8 BRR2_1, BRR2_2;
  u32 BaudRate_Mantissa, BaudRate_Mantissa100;

  assert_param(IS_LINUART_WORDLENGTH_VALUE_OK(LINUART_InitStruct->WordLength));

  assert_param(IS_LINUART_STOPBITS_VALUE_OK(LINUART_InitStruct->StopBits));

  assert_param(IS_LINUART_PARITY_VALUE_OK(LINUART_InitStruct->Parity));

  /* assert_param: BaudRate value should be <= 625000 bps */
  assert_param(IS_LINUART_BAUDRATE_OK(LINUART_InitStruct->BaudRate));

  /* assert_param: LINUART_Mode value should exclude values such as  LINUART_ModeTx_Enable|LINUART_ModeTx_Disable */
  assert_param(IS_LINUART_MODE_VALUE_OK((u8)LINUART_InitStruct->Mode));

  /* Wait for no Transmition before modifying the M bit */
  /* while(!(LINUART->SR&LINUART_SR_TC));      */

  LINUART->CR1 &= (u8)(~LINUART_CR1_M);     /**< Clear the word length bit */
  LINUART->CR1 |= (u8)LINUART_InitStruct->WordLength; /**< Set the word length bit according to LINUART_WordLength value */

  LINUART->CR3 &= (u8)(~LINUART_CR3_STOP);  /**< Clear the STOP bits */
  LINUART->CR3 |= (u8)LINUART_InitStruct->StopBits;  /**< Set the STOP bits number according to LINUART_StopBits value  */

  LINUART->CR1 &= (u8)(~(LINUART_CR1_PCEN | LINUART_CR1_PS));  /**< Clear the Parity Control bit */
  LINUART->CR1 |= (u8)LINUART_InitStruct->Parity;     /**< Set the Parity Control bit to LINUART_Parity value */

  LINUART->BRR1 &= (u8)(~LINUART_BRR1_DIVM);  /**< Clear the LSB mantissa of LINUARTDIV  */
  LINUART->BRR2 &= (u8)(~LINUART_BRR2_DIVM);  /**< Clear the MSB mantissa of LINUARTDIV  */
  LINUART->BRR2 &= (u8)(~LINUART_BRR2_DIVF);  /**< Clear the Fraction bits of LINUARTDIV */

  /**< Set the LINUART BaudRates in BRR1 and BRR2 registers according to LINUART_BaudRate value */
  BaudRate_Mantissa    = ((u32)CLK_GetClockFreq() / (LINUART_InitStruct->BaudRate << 4));
  BaudRate_Mantissa100 = (((u32)CLK_GetClockFreq() * 100) / (LINUART_InitStruct->BaudRate << 4));
  BRR2_1 = (u8)((u8)(((BaudRate_Mantissa100 - (BaudRate_Mantissa * 100))
                      << 4) / 100) & (u8)0x0F); /**< Set the fraction of USARTDIV  */
  BRR2_2 = (u8)((BaudRate_Mantissa >> 4) & (u8)0xF0);

  LINUART->BRR2 = (u8)(BRR2_1 | BRR2_2);
  LINUART->BRR1 = (u8)BaudRate_Mantissa;           /**< Set the LSB mantissa of LINUARTDIV  */

  if ((u8)LINUART_InitStruct->Mode&(u8)LINUART_MODE_TX_ENABLE)
  {
    LINUART->CR2 |= LINUART_CR2_TEN;  /**< Set the Transmitter Enable bit */
  }
  else
  {
    LINUART->CR2 &= (u8)(~LINUART_CR2_TEN);  /**< Clear the Transmitter Disable bit */
  }
  if ((u8)LINUART_InitStruct->Mode & (u8)LINUART_MODE_RX_ENABLE)
  {
    LINUART->CR2 |= LINUART_CR2_REN;  /**< Set the Receiver Enable bit */
  }
  else
  {
    LINUART->CR2 &= (u8)(~LINUART_CR2_REN);  /**< Clear the Receiver Disable bit */
  }
}

/**
  * @brief Enables or disables the specified LINUART interrupts.
  * @par Full description:
  * Enables or disables the specified LINUART interrupts.
  * @param[in] LINUART_IT Specifies the LINUART interrupt sources to be
  * enabled or disabled.
  * @param[in] NewState New state of the specified LINUART interrupts.
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * @code
  * LINUART_ITConfig(LINUART_IT_PIEN, ENABLE)
  * @endcode
  */
void LINUART_ITConfig(LINUART_IT_TypeDef LINUART_IT, FunctionalState NewState)
{
  assert_param(IS_LINUART_IT_VALUE_OK(LINUART_IT));
  assert_param(IS_STATE_VALUE_OK(NewState));

  if (NewState)
  {
    /**< Enable the Interrupt bits according to LINUART_IT mask */
    LINUART->CR2 |= (u8)(((u8)LINUART_IT) & (u8)(LINUART_CR2_TIEN | LINUART_CR2_TCIEN | LINUART_CR2_RIEN | LINUART_CR2_ILIEN));
    LINUART->CR1 |= (u8)((u8)LINUART_IT & LINUART_CR1_PIEN);
    LINUART->CR4 |= (u8)((u8)((u8)LINUART_IT << 3) & LINUART_CR4_LBDIEN);
    LINUART->CR5 |= (u8)((u8)LINUART_IT  & LINUART_CR5_LHDIEN);
  }
  else
  {
    /**< Disable the interrupt bits according to LINUART_IT mask */

    LINUART->CR2 &= (u8)(~(((u8)LINUART_IT) & (u8)(LINUART_CR2_TIEN | LINUART_CR2_TCIEN | LINUART_CR2_RIEN | LINUART_CR2_ILIEN)));
    LINUART->CR1 &= (u8)(~((u8)LINUART_IT & LINUART_CR1_PIEN));

