xinghaozhe/BCM/JBC012_B501_20120408_S1.5/Souces/Src/stm8_linuart.c
LINUART->CR4 &= (u8)(~((u8)((u8)LINUART_IT << 3) & LINUART_CR4_LBDIEN));
    LINUART->CR5 &= (u8)(~((u8)LINUART_IT  & LINUART_CR5_LHDIEN));
  }

}

/**
  * @brief Sets the LINUART LIN Break detection length.
  * @par Full description:
  * Sets the LINUART LIN Break detection length.
  * @param[in] LINUART_LINBreakDetectionLength specifies the LIN break
  *                    detection length.
  *                    This parameter can be one of the following values:
  *                       - LINUART_BREAK10BITS
  *                       - LINUART_BREAK11BITS
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * @code
  * LINUART_LINBreakDetectionConfig(LINUART_BREAK11BITS)
  * @endcode
  */
void LINUART_LINBreakDetectionConfig(LINUART_LINBreakDetectionLength_TypeDef LINUART_LINBreakDetectionLength)
{
  assert_param(IS_LINUART_LINBREAKDETECTIONLENGTH_VALUE_OK(LINUART_LINBreakDetectionLength));

  if (LINUART_LINBreakDetectionLength == LINUART_BREAK10BITS)
  {
    LINUART->CR4 &= ((u8)~LINUART_CR4_LBDL);
  }
  else
  {
    LINUART->CR4 |= LINUART_CR4_LBDL;
  }
}

/**
  * @brief Configue the LINUART peripheral.
  * @par Full description:
  * Configue the LINUART peripheral.
  * @param[in] LINUART_Slave specifies the LIN mode.
  *                    This parameter can be one of the following values:
  *                       - LINUART_LIN_MASTER_MODE
  *                       - LINUART_LIN_SLAVE_MODE
	* @param[in] LINUART_Autosync specifies the LIN automatic resynchronization mode.
  *                    This parameter can be one of the following values:
  *                       - LINUART_LIN_AUTOSYNC_ENABLE
  *                       - LINUART_LIN_AUTOSYNC_DISABLE
	* @param[in] LINUART_DivUp specifies the LIN divider update method.
  *                    This parameter can be one of the following values:
  *                       - LINUART_LIN_DIVUP_LBRR1
  *                       - LINUART_LIN_DIVUP_NEXTRXNE
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * @code
  * LINUART_LINConfig(LINUART_LIN_MASTER_MODE,LINUART_LIN_AUTOSYNC_DISABLE,LINUART_LIN_DIVUP_LBRR1);
  * @endcode
  */
void LINUART_LINConfig(LINUART_Slave_TypeDef LINUART_Slave, LINUART_Autosync_TypeDef LINUART_Autosync, LINUART_DivUp_TypeDef LINUART_DivUp)
{
  assert_param(IS_LINUART_SLAVE_VALUE_OK(LINUART_Slave));

  assert_param(IS_LINUART_AUTOSYNC_VALUE_OK(LINUART_Autosync));

  assert_param(IS_LINUART_DIVUP_VALUE_OK(LINUART_DivUp));

  if (LINUART_Slave == LINUART_LIN_MASTER_MODE)
  {
    LINUART->CR5 &= ((u8)~LINUART_CR5_LSLV);
  }
  else
  {
    LINUART->CR5 |=  LINUART_CR5_LSLV;
  }

  if (LINUART_Autosync == LINUART_LIN_AUTOSYNC_DISABLE)
  {
    LINUART->CR5 &= ((u8)~ LINUART_CR5_LASE );
  }
  else
  {
    LINUART->CR5 |=  LINUART_CR5_LASE ;
  }

  if (LINUART_DivUp == LINUART_LIN_DIVUP_LBRR1)
  {
    LINUART->CR5 &= ((u8)~ LINUART_CR5_LDUM);
  }
  else
  {
    LINUART->CR5 |=  LINUART_CR5_LDUM;
  }

}

/**
  * @brief Enables or disables the LINUART LIN mode.
  * @par Full description:
  * Enables or disables the LINUART’s LIN mode.
  * @param[in] NewState is new state of the LINUART LIN mode.
  *                    This parameter can be: ENABLE or DISABLE.
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * @code
  * LINUART_LINCmd(ENABLE)
  * @endcode
  */
void LINUART_LINCmd(FunctionalState NewState)
{
  assert_param(IS_STATE_VALUE_OK(NewState));

  if (NewState)
  {
    /* Enable the LIN mode by setting the LINE bit in the CR2 register */
    LINUART->CR3 |= LINUART_CR3_LINEN;
  }
  else
  {
    /* Disable the LIN mode by clearing the LINE bit in the CR2 register */
    LINUART->CR3 &= ((u8)~LINUART_CR3_LINEN);
  }
}
/**
  * @brief Returns the most recent received data by the LINUART peripheral.
  * @par Full description:
  * Returns the most recent received data by the LINUART peripheral.
  * @retval u16 Received Data
  * @par Required preconditions:
  * LINUART_Cmd(ENABLE);
  * @par Called functions:
  * None
  * @par Example:
  * @code
  * u8 my_data;
  * my_data = LINUART_ReceiveData8();
  * @endcode
  */
u8 LINUART_ReceiveData8(void)
{
  return LINUART->DR;
}


/**
  * @brief Returns the most recent received data by the LINUART peripheral.
  * @par Full description:
  * Returns the most recent received data by the LINUART peripheral.
  * @retval u16 Received Data
  * @par Required preconditions:
  * LINUART_Cmd(ENABLE);
  * @par Called functions:
  * None
  * @par Example:
  * @code
  * u16 my_data;
  * my_data = LINUART_ReceiveData9();
  * @endcode
  */
u16 LINUART_ReceiveData9(void)
{
  return (u16)((((u16)LINUART->DR) | ((u16)(((u16)((u16)LINUART->CR1 & (u16)LINUART_CR1_R8)) << 1))) & ((u16)0x01FF));
}

/**
  * @brief Determines if the LINUART is in mute mode or not.
  * @par Full description:
  * Determines if the LINUART is in mute mode or not.
  * @param[in] NewState: new state of the LINUART mode.
  *                    This parameter can be: ENABLE or DISABLE.
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * @code
  * LINUART_ReceiverWakeUpCmd(DISABLE);
  * @endcode
  */
void LINUART_ReceiverWakeUpCmd(FunctionalState NewState)
{
  assert_param(IS_STATE_VALUE_OK(NewState));

  if (NewState)
  {
    /* Enable the mute mode LINUART by setting the RWU bit in the CR2 register */
    LINUART->CR2 |= LINUART_CR2_RWU;
  }
  else
  {
    /* Disable the mute mode LINUART by clearing the RWU bit in the CR1 register */
    LINUART->CR2 &= ((u8)~LINUART_CR2_RWU);
  }
}

/**
  * @brief Transmits break characters.
  * @par Full description:
  * Transmits break characters on the LINUART peripheral.
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * @code
  * LINUART_SendBreak();
  * @endcode
  */
void LINUART_SendBreak(void)
{
  LINUART->CR2 |= LINUART_CR2_SBK;
}

/**
  * @brief Transmits 8 bit data through the LINUART peripheral.
  * @par Full description:
  * Transmits 8 bit data through the LINUART peripheral.
  * @param[in] Data: the data to transmit.
  * @retval void None
  * @par Required preconditions:
  * LINUART_Cmd(ENABLE);
  * @par Called functions:
  * None
  * @par Example:
  * Send 0x55 using LINUART
  * @code
  * u8 my_data = 0x55;
  * LINUART_SendData8(my_data);
  * @endcode
  */
void LINUART_SendData8(u8 Data)
{
  /* Transmit Data */
  LINUART->DR = Data;
}

/**
  * @brief Transmits 9 bit data through the LINUART peripheral.
  * @par Full description:
  * Transmits 9 bit data through the LINUART peripheral.
  * @param[in] Data: the data to transmit.
  * @retval void None
  * @par Required preconditions:
  * LINUART_Cmd(ENABLE);
  * @par Called functions:
  * None
  * @par Example:
  * Send 0x103 using LINUART
   * @code
  * u16 my_data = 0x103;
  * LINUART_SendData9(my_data);
  * @endcode
  */
void LINUART_SendData9(u16 Data)
{
  LINUART->CR1 &= ((u8)~LINUART_CR1_T8);                  /**< Clear the transmit data bit 8     */
  LINUART->CR1 |= (u8)(((u8)(Data >> 2)) & LINUART_CR1_T8); /**< Write the transmit data bit [8]   */
  LINUART->DR   = (u8)(Data);                    /**< Write the transmit data bit [0:7] */

