xinghaozhe/BCM/JBC012_B501_20120408_S1.5/Souces/Src/stm8_linuart.c
}

/**
  * @brief Sets the address of the LINUART node.
  * @par Full description:
  * Sets the address of the LINUART node.
  * @param[in] LINUART_Address: Indicates the address of the LINUART node.
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * Set the address of the LINUART node at 0x04
  * @code
  * u8 my_LINUART_Address = 0x04;
  * LINUART_SetAddress(my_LINUART_Address);
  * @endcode
  */
void LINUART_SetAddress(u8 LINUART_Address)
{
  /*assert_param for x LINUART_Address*/
  assert_param(IS_LINUART_LINUART_Address_VALUE_OK(LINUART_Address));

  /* Clear the LINUART address */
  LINUART->CR4 &= ((u8)~LINUART_CR4_ADD);
  /* Set the LINUART address node */
  LINUART->CR4 |= LINUART_Address;
}


/**
  * @brief Selects the LINUART WakeUp method.
  * @par Full description:
  * Selects the LINUART WakeUp method.
  * @param[in] LINUART_WakeUp: specifies the LINUART wakeup method.
  *                    This parameter can be one of the following values:
  *                        - LINUART_WAKEUP_IDLELINE
  *                        - LINUART_WAKEUP_ADDRESSMARK
  * @retval void None
  * @par Required preconditions:
  * None
  * @par Called functions:
  * None
  * @par Example:
  * LINUART WakeUp Idle line .
  * @code
    * LINUART_WakeUpConfig(LINUART_WAKEUP_IDLELINE);
  * @endcode
  */
void LINUART_WakeUpConfig(LINUART_WakeUp_TypeDef LINUART_WakeUp)
{
  assert_param(IS_LINUART_WAKEUP_VALUE_OK(LINUART_WakeUp));

  LINUART->CR1 &= ((u8)~LINUART_CR1_WAKE);
  LINUART->CR1 |= (u8)LINUART_WakeUp;
}

/**
  * @}
  */

/******************* (C) COPYRIGHT 2007 STMicroelectronics *****END OF FILE****/
